In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib
import scipy
import numpy as np
import csv

In [3]:
file = "wip_csv/clean_celebs.csv"
clean_celebs1 = pd.read_csv(file)
#for some reason needed to drop unnamed column 
clean_celebs1.drop(columns =["Unnamed: 0"], inplace = True) 
#clean_celebs1.head()

In [4]:
file2 = "../SSN_data/part3.csv"
clean_muggles = pd.read_csv(file2)
#for some reason needed to drop unnamed column 
clean_muggles.drop(columns =["Unnamed: 0"], inplace = True)

In [5]:
clean_muggles.head()

  decades     name  number
0     00s    Aadan      18
1     00s  Aadarsh       5
2     00s    Aaden    2285
3     00s   Aadhya      11
4     00s     Aadi     205

In [6]:
sel_list = []
for i in clean_muggles.decades:
    if i == '10s' or i == '20s'or i == '30s'or i == '40s'or i == '50s'or i == '60s'or i == '70s' :
        sel_list.append(True)
    else:
        sel_list.append(False)

In [8]:
picked_decades_df=pd.Series(sel_list)
decades_df = pd.DataFrame(clean_muggles[picked_decades_df])
decades_df.head()

      decades    name  number
16663     10s   Aaron    4231
16664     10s   Abbie     625
16665     10s  Abbott      18
16666     10s   Abdon       6
16667     10s     Abe    1630

In [19]:
sel_list1 = []
for i in decades_df['name']:
    if i == 'Serena':
        sel_list1.append(True)
    else:
        sel_list1.append(False)

In [20]:
name_df1=pd.Series(sel_list1)
decades_df2 = decades_df.reset_index()
#name_df1
final_name_df = pd.DataFrame(decades_df2[name_df1])
final_name_df

       index decades    name  number
4466   21129     10s  Serena      15
10655  43430     20s  Serena      31
16163  48938     30s  Serena      79
21613  54388     40s  Serena     155
27598  60373     50s  Serena     506
34235  67010     60s  Serena    2040
42671  75446     70s  Serena    4393